Simulations/Chapter Five/0.orig/nut
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    inlet
	{
		type       		timeVaryingMappedFixedValue;
		setAverage      false;
		perturb         0;
    }
    outlet
    {
        type            calculated;
        value           uniform 0;
    }
    bottom
    {
        type            nutUSpaldingWallFunction;
        value           uniform 0;
        maxIter			100;
        tolerance		1e-07;
    }
    lateralWall
    {
        type            nutUSpaldingWallFunction;
        value           uniform 0;
        maxIter			100;
        tolerance		1e-07;
    }
    freeSurface
    {
        type            zeroGradient;
    }
    farField
    {
		type			zeroGradient;
	}
}


// ************************************************************************* //
