Simulations/Chapter Five/system/decomposeParDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1912                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      decomposeParDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

numberOfSubdomains    8;

method          scotch;

scotchCoeffs
{
}

constraints
{
	// Keep owner and neighbour on same processor for faces in zones
	faces
    {
        type    preserveFaceZones;
        zones   (interface interfaceBottom interfaceMiddle interfaceTop);
        enabled true;
    }
}

// ************************************************************************* //
